#include <iostream>
using namespace std;

// Функція для конвертації десяткового числа в вісімкове
void decimalToOctal(int number) {
    // Базовий випадок: якщо число 0, вихід з функції
    if (number == 0) {
        return;
    }
    // Рекурсивний виклик функції зі зменшеним числом та виведення залишку
    decimalToOctal(number / 8);
    cout << number % 8; // Виведення залишку числа при діленні на 8
}

int main() {
    int number;
    // Запит користувача на введення натурального числа
    cout << "Введіть натуральне число: ";
    cin >> number;
    cout << "Число у вісімковій системі числення: ";
    // Спеціальний випадок: якщо введене число 0, виведення "0" і завершення програми
    if (number == 0) {
        cout << "0";
        return 0;
    }
    // Виклик функції для конвертації та виведення результату
    decimalToOctal(number);
    cout << endl;
    return 0;
}
